{
    "drivers": [
      {
        "id": 1,
        "driverRef": "hamilton",
        "number": 44,
        "code": "HAM",
        "name": { "forename": "Lewis", "surname": "Hamilton" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613917/ham_yyijcr.png"
        },
        "dob": "1985-07-01",
        "nationality": "British",
        "teams": "McLaren, Mercedes",
        "description": "Sir Lewis Carl Davidson Hamilton MBE HonFREng (born 7 January 1985) is a British racing driver currently competing in Formula One, driving for Mercedes-AMG Petronas Formula One Team. In Formula One, Hamilton has won a joint-record seven World Drivers' Championship titles (tied with Michael Schumacher), and holds the records for the most wins (103), pole positions (103), and podium finishes (191), among many others. He is statistically considered as the most successful driver in Formula One history."
      },
      {
        "id": 2,
        "driverRef": "verstappen",
        "number": "\\N",
        "code": "VER",
        "name": { "forename": "Max", "surname": "Verstappen" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613951/ver_mhioqo.png"
        },
        "dob": "1997-09-30",
        "nationality": "Dutch",
        "teams": "Toro Rosso, Red Bull",
        "description": "Max Emilian Verstappen (born 30 September 1997) is a Belgian and Dutch racing driver competing in Formula One, where he is the 2021, 2022, and 2023 World Champion. He races under the Dutch flag in Formula One for Red Bull Racing. Verstappen is the son of former Formula One driver Jos Verstappen, and former go-kart racer Sophie Kumpen. He had a successful run in karting and single-seater categories  including FIA European Formula 3  breaking several records."
      },
      {
        "id": 3,
        "driverRef": "Leclerc",
        "number": "\\N",
        "code": "LEC",
        "name": { "forename": "Charles", "surname": "Leclerc" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613927/lec_p9hl4u.png"
        },
        "dob": "1997-10-16",
        "nationality": "Monégasque",
        "teams": "Test driver, Sauber, Ferrari",
        "description": "Charles Marc Hervé Perceval Leclerc (born 16 October 1997) is a Monégasque racing driver, currently racing in Formula One for Scuderia Ferrari. He won the GP3 Series championship in 2016 and the FIA Formula 2 Championship in 2017.Leclerc made his Formula One debut in 2018 for Sauber, a team affiliated with Ferrari, for which he was part of the Ferrari Driver Academy. With Sauber having finished last the year before, Leclerc led the charge to improve its finishing position in the Constructors' Championship to eighth, and was the higher ranked of the two Sauber drivers. He joined Ferrari the next season and became the second-youngest driver to qualify on pole position in Formula One at the 2019 Bahrain Grand Prix. The 2019 season also saw Leclerc take his first career win in Belgium. He won the FIA Pole Trophy for most pole positions in the 2019 season, becoming the youngest driver to win it, before winning it again in 2022."
      },
      {
        "id": 4,
        "driverRef": "Bottas",
        "number": "\\N",
        "code": "BOT",
        "name": { "forename": "Valtteri", "surname": "Bottas" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613911/bot_v6qhmc.png"
        },
        "dob": "1989-08-28",
        "nationality": "Finnish",
        "teams": "Williams, Mercedes, Alfa Romeo, Sauber",
        "description": "Valtteri Viktor Bottas (born 28 August 1989) is a Finnish racing driver currently competing in Formula One for Stake F1 Team Kick Sauber, having previously driven for Mercedes from 2017 to 2021 and Williams from 2013 to 2016. Bottas has scored 10 race wins and 67 podiums. He contributed to five Constructors' Championship wins for Mercedes, and has been Drivers' Championship runner-up twice, in 2019 and 2020.Bottas started his racing career in karting, later advancing to single-seater championships such as the Formula Renault UK Winter Series, Formula Renault Eurocup and the Formula Renault Northern European Cup, winning the latter two in 2008. In 2009, he moved up to the Formula 3 Euroseries, finishing third in the championship and also winning the Masters of Formula 3 event. In 2010, he was hired as a test driver for the Williams Formula One team, a position he would retain throughout 2011 and 2012, taking part in 15 Friday Free Practice sessions. In 2011, he also took part in the GP3 Series, winning the championship in the final race of the season."
      },
      {
        "id": 5,
        "driverRef": "Pérez",
        "number": "\\N",
        "code": "PER",
        "name": { "forename": "Sergio", "surname": "Pérez" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613934/per_kxwbqb.png"
        },
        "dob": "1990-06-26",
        "nationality": "Mexican",
        "teams": "Sauber, McLaren, Force India, Racing Point, Red Bull",
        "description": "Sergio Michel 'Checo' Pérez Mendoza (born 26 January 1990) is a Mexican racing driver who races in Formula One for Red Bull Racing, having previously driven for Sauber, McLaren, Force India, and Racing Point. He has won six Grand Prix races and scored 39 podium finishes. He won his first Grand Prix driving for Racing Point at the 2020 Sakhir Grand Prix, breaking the record for the number of starts before a race win at 190. He earned his first Formula One pole position at the 2022 Saudi Arabian Grand Prix, breaking the record for the most races before a first pole position at 215. Up until 2012, Pérez was a member of the Ferrari Driver Academy. He made his Formula One debut driving for Sauber during the 2011 season. He took his first Formula One podium at the 2012 Malaysian Grand Prix with Sauber. Due to his young age and performance, he was referred to as 'The Mexican Wunderkind'. Pérez joined McLaren for the 2013 season, but the team did not score a single podium finish. Subsequently, the team decided to replace Pérez with Kevin Magnussen for the 2014 season."
      },
      {
        "id": 6,
        "driverRef": "Sainz",
        "number": "\\N",
        "code": "SAI",
        "name": { "forename": "Carlos", "surname": "Sainz" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613944/sai_uzd5nb.png"
        },
        "dob": "1994-09-01",
        "nationality": "Spanish",
        "teams": "Toro Rosso, Renault, McLaren, Ferrari",
        "description": "In 2012, Sainz raced in the British and European Formula 3 championships for Carlin. He raced for DAMS in the 2014 Formula Renault 3.5 season, winning the championship before moving to F1 with Toro Rosso. Sainz joined Renault for the 2017 and 2018 seasons. Sainz moved to McLaren for the 2019 season, while at the same time ending his contract with Red Bull Racing. At the 2019 Brazilian Grand Prix Sainz took his maiden Formula One podium finish with third. Sainz moved to Ferrari at the end of the 2020 season. At the 2022 British Grand Prix, Sainz took his maiden Formula One pole position and career win. He achieved his second Formula One win at the 2023 Singapore Grand Prix, after starting on pole position for the fifth time in his career.He is set to leave Ferrari at the end of 2024 as Lewis Hamilton joins the team. After missing the Saudi Arabian Grand Prix due to appendicitis, Sainz scored another Formula One win at the following 2024 Australian Grand Prix starting from second."
      },
      {
        "id": 7,
        "driverRef": "Norris",
        "number": "\\N",
        "code": "NOR",
        "name": { "forename": "Lando", "surname": "Norris" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613933/nor_txql6z.png"
        },
        "dob": "1999-11-13",
        "nationality": "British",
        "teams": "McLaren",
        "description": "Lando Norris (born 13 November 1999) is a British and Belgian racing driver currently competing in Formula One with McLaren, racing under the British flag. He won the MSA Formula championship in 2015, and the Toyota Racing Series, Eurocup Formula Renault 2.0 and Formula Renault 2.0 Northern European Cup in 2016. He also received the McLaren Autosport BRDC Award that year. He subsequently joined the McLaren Young Driver Programme in 2017 and won the 2017 FIA Formula 3 European Championship, competing with Carlin Motorsport. Consequently, he was promoted to the Formula 2 Carlin team, where he finished second in 2018. He was then announced as a McLaren driver in 2018, alongside Carlos Sainz Jr. He achieved his first podium in Formula One at the 2020 Austrian Grand Prix."
      },
      {
        "id": 8,
        "driverRef": "Russel",
        "number": "\\N",
        "code": "RUS",
        "name": { "forename": "George", "surname": "Russel" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613939/rus_ql0xg2.png"
        },
        "dob": "1998-02-15",
        "nationality": "British",
        "teams": "Williams, Mercedes",
        "description": "George William Russell (born 15 February 1998) is a British racing driver currently competing in Formula One for Mercedes. He previously raced for Williams from 2019 to 2021. After winning several karting championships including the CIK-FIA European Karting Championship in 2012, he repeated his success by becoming the 2018 Formula 2 champion and the 2017 GP3 Series champion, driving for ART in both campaigns to become one of only three drivers to win both championships in his respective rookie seasons. Following his Formula 2 championship win, Russell signed for Williams in 2019, making his debut at the 2019 Australian Grand Prix. He stood in for Lewis Hamilton at Mercedes at the 2020 Sakhir Grand Prix, but was denied a Grand Prix victory due to strategic errors. In 2022, Russell departed Williams to race for the Mercedes team, having been a member of the Mercedes Junior Driver Programme since 2017. Russell achieved his first F1 victory at the 2022 São Paulo Grand Prix."
      },
      {
        "id": 9,
        "driverRef": "ALONSO",
        "number": "\\N",
        "code": "ALO",
        "name": { "forename": "Fernando", "surname": "Alonso" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613910/alo_lt7w5h.png"
        },
        "dob": "1981-07-29",
        "nationality": "Spanish",
        "teams": "Minardi, Renault, McLaren, Ferrari, Alpine, Aston Martin",
        "description": "Fernando Alonso Díaz (born 29 July 1981) is a Spanish racing driver currently competing for Aston Martin in Formula One. He won the series' World Drivers' Championship in 2005 and 2006 with Renault, and has also driven for McLaren, Ferrari, and Minardi. With Toyota, Alonso won the 24 Hours of Le Mans twice, in 2018 and 2019, and the FIA World Endurance Championship in 2018/19. He also won the 24 Hours of Daytona with Wayne Taylor Racing in 2019. As of 2024, Alonso is the only driver to win both the F1 World Drivers' Championship and the World Endurance Championship, even if the World Sportscar Championship is included in WEC."
      },
      {
        "id": 10,
        "driverRef": "OCON",
        "number": "\\N",
        "code": "OCO",
        "name": { "forename": "Esteban", "surname": "Ocon" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613933/oco_xzncki.png"
        },
        "dob": "1996-09-17",
        "nationality": "French",
        "teams": "Manor, Force India, Mercedes, Renault, Alpine",
        "description": "Esteban José Jean-Pierre Ocon-Khelfane (born 17 September 1996) is a French racing driver currently competing in Formula One for Alpine. Ocon experienced a successful junior career as he won the 2014 FIA Formula 3 European Championship and the 2015 GP3 Series despite only winning one race in the latter campaign, which earned him a place at the Mercedes driver development programme, for whom he worked as a reserve driver. After winning the GP3 title, Ocon made his Formula One debut for Manor Racing in the 2016 Belgian Grand Prix, replacing Rio Haryanto. He moved to Force India/Racing Point in 2017, partnering Mexican driver Sergio Pérez for the 2017 and 2018 Formula 1 seasons. Ocon left Racing Point at the end of 2018, and became a reserve driver for Mercedes in 2019 until his move to Renault for 2020. He took his maiden Formula One podium at the 2020 Sakhir Grand Prix and maiden victory at the 2021 Hungarian Grand Prix."
      },
      {
        "id": 11,
        "driverRef": "GASLY",
        "number": "\\N",
        "code": "GAS",
        "name": { "forename": "Pierre", "surname": "Gasly" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613912/gas_afle8z.png"
        },
        "dob": "1996-02-07",
        "nationality": "French",
        "teams": "Toro Rosso, Red Bull, AlphaTauri, Alpine",
        "description": "Pierre Jean-Jacques Gasly (born 7 February 1996) is a French racing driver currently competing in Formula One for Alpine. He won the 2016 GP2 Series championship, and finished as runner-up in the 2014 Formula Renault 3.5 Series and the 2017 Super Formula Championship. Gasly made his Formula One debut with Toro Rosso at the 2017 Malaysian Grand Prix. He moved to Red Bull Racing in 2019, before being demoted and replaced with Alexander Albon from Toro Rosso between the Hungarian and Belgian rounds. Regardless, Gasly achieved his first podium at the 2019 Brazilian Grand Prix, finishing second. He won at the 2020 Italian Grand Prix while driving for AlphaTauri, securing his maiden victory in Formula One. He would achieve another podium at the 2021 Azerbaijan Grand Prix by finishing third behind eventual race winner Sergio Pérez and Sebastian Vettel."
      },
      {
        "id": 12,
        "driverRef": "Ricciardo",
        "number": "\\N",
        "code": "RIC",
        "name": { "forename": "Daniel", "surname": "Ricciardo" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613938/ric_pcpoyq.png"
        },
        "dob": "1989-07-01",
        "nationality": "Australian",
        "teams": "Red Bull, HRT, Toro Rosso, Renault, McLaren, AlphaTauri",
        "description": "Daniel Joseph Ricciardo AM (born 1 July 1989) is an Australian and Italian racing driver currently competing in Formula One for RB Formula One Team under the Australian flag. He has achieved eight Grand Prix victories and 32 podiums in Formula One. Ricciardo made his debut at the 2011 British Grand Prix with the HRT team as part of a deal with Red Bull Racing, for whom he was test driving under its sister team Scuderia Toro Rosso. He joined Toro Rosso in 2012 full-time after the team changed its driver lineup and drove a Ferrari-powered car for them in 2012 and 2013. In 2014, Ricciardo was promoted to Red Bull as a replacement for the retiring Mark Webber alongside Sebastian Vettel. In his first season with Red Bull under Renault power, Ricciardo finished third in the championship with his first three Formula One wins, in Canada, Hungary, and Belgium."
      },
      {
        "id": 13,
        "driverRef": "Vettel",
        "number": "\\N",
        "code": "VET",
        "name": { "forename": "Sebastian", "surname": "Vettel" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613957/vet_iplgpu.png"
        },
        "dob": "1987-07-03",
        "nationality": "German",
        "teams": "BMW Sauber, Toro Rosso, Red Bull, Ferrari, Aston Martin",
        "description": "Sebastian Vettel (born 3 July 1987) is a German racing driver who competed in Formula One from 2007 to 2022 for BMW Sauber, Toro Rosso, Red Bull, Ferrari and Aston Martin. Vettel is one of the most successful drivers in Formula One history and has won four World Drivers' Championship titles, which he won consecutively from 2010 to 2013 with Red Bull. Vettel holds the record for being the youngest World Champion in Formula One, has the fourth-most race victories (53), third-most podium finishes (122), and fourth-most pole positions (57)."
      },
      {
        "id": 14,
        "driverRef": "Albon",
        "number": "\\N",
        "code": "ALB",
        "name": { "forename": "Alexander", "surname": "Albon" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613911/alb_xpvn0l.png"
        },
        "dob": "1996-03-23",
        "nationality": "Thai",
        "teams": "Toro Rosso, Red Bull, Williams",
        "description": "Alexander Albon Ansusinha (born 23 March 1996) is a Thai and British racing driver currently competing in Formula One for Williams Racing, under the Thai flag. Albon previously raced in Formula One for Scuderia Toro Rosso and Red Bull Racing and in DTM for AF Corse. After becoming part of the Red Bull Junior Team in 2012, he was promoted to open-wheel cars for the 2012 Eurocup Formula Renault 2.0 season. He spent three years in the series and finished third in the 2014 championship. He moved to the FIA Formula 3 European Championship in 2015, where he finished seventh. He signed with ART Grand Prix to contest the 2016 GP3 Series, and ended the season as runner-up behind teammate Charles Leclerc. In 2017 Albon moved up to the FIA Formula 2 Championship with ART, where he finished his maiden year tenth in the standings. He then switched to the DAMS team for 2018, winning four races and finishing third in the championship. He made his Formula One début in 2019 with Toro Rosso alongside Daniil Kvyat. After twelve races, Albon was promoted to Red Bull Racing, partnering Max Verstappen and replacing Pierre Gasly. He took his first podium finish and the first in a World Championship Formula One race for a Thai driver at the 2020 Tuscan Grand Prix. After two seasons in Formula One, Albon was demoted to a test and reserve driver role with Red Bull for 2021 and his seat was taken by Sergio Pérez. Albon returned to Formula One in 2022, driving for Williams, replacing fellow 2019 rookie George Russell, and continued with the team in 2023"
      },
      {
        "id": 15,
        "driverRef": "Magnussen",
        "number": "\\N",
        "code": "MAG",
        "name": { "forename": "Kevin", "surname": "Magnussen" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613927/mag_hqwpux.png"
        },
        "dob": "1992-10-05",
        "nationality": "Danish",
        "teams": "McLaren, Renault, Haas",
        "description": "Kevin Jan Magnussen (born 5 October 1992) is a Danish racing driver currently competing in Formula One for Haas F1 Team. He is the son of four-time Le Mans winner and former Formula One driver Jan Magnussen. Magnussen came up through McLaren Formula One team's Young Driver Programme and drove for McLaren in the 2014 Formula One World Championship, before a stint with Renault in 2016. Magnussen drove for Haas from 2017 until the end of the 2020 season. In 2022, Magnussen rejoined Haas on a multi-year deal."
      },
      {
        "id": 16,
        "driverRef": "Guanyu",
        "number": "\\N",
        "code": "GUA",
        "name": { "forename": "Zhou", "surname": "Guanyu" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613916/gua_vspbv8.png"
        },
        "dob": "1999-05-30",
        "nationality": "Chinese",
        "teams": "Alfa Romeo, Sauber",
        "description": "Zhou Guanyu (born 30 May 1999) is a Chinese racing driver who currently competes in Formula One for Stake F1 Team Kick Sauber. He is the first, and so far the only, Chinese driver to start a World Championship Formula One race. He competed in the FIA Formula 2 Championship for UNI-Virtuosi Racing from 2019 to 2021, having finished 3rd in the 2021 campaign. A former member of the Alpine Academy, he served as the test driver for the Renault F1 Team and the Alpine F1 Team in 2020 and 2021 respectively.Prior to that, he was a member of the Ferrari Driver Academy from 2014 to 2018, and served as the development driver for Formula E team DS Techeetah in 2018."
      },
      {
        "id": 17,
        "driverRef": "Stroll",
        "number": "\\N",
        "code": "STR",
        "name": { "forename": "Lance", "surname": "Stroll" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613945/str_w1a21a.png"
        },
        "dob": "1998-10-29",
        "nationality": "Canadian",
        "teams": "Williams, Racing Point, Aston Martin",
        "description": "Lance Strulovitch (born 29 October 1998), better known as Lance Stroll, is a Canadian and Belgian racing driver competing under the Canadian flag in Formula One. He has driven for Aston Martin since 2021, having previously driven for Williams and Racing Point. He was Italian F4 champion in 2014, Toyota Racing Series champion in 2015, and 2016 FIA European Formula 3 champion. He was part of the Ferrari Driver Academy from 2010 to 2015. He achieved his first podium finish, a 3rd place, at the 2017 Azerbaijan Grand Prix, becoming the second-youngest driver to finish an F1 race on the podium and the youngest to do so during his rookie season. At the 2020 Turkish Grand Prix, Stroll took his first pole position in Formula One. Stroll also competed in endurance racing, taking part in the 24 Hours of Daytona in 2016 and 2018."
      },
      {
        "id": 18,
        "driverRef": "Giovinazzi",
        "number": "\\N",
        "code": "GIO",
        "name": { "forename": "Antonio", "surname": "Giovinazzi" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613916/gio_ovrkkb.png"
        },
        "dob": "1993-12-14",
        "nationality": "Italian",
        "teams": "Alfa Romeo, Ferrari, Alpine",
        "description": "Antonio Maria Giovinazzi (born 14 December 1993) is an Italian racing driver who currently competes in the 2024 FIA World Endurance Championship driving for Ferrari AF Corse. He was the 2015 FIA Formula 3 European Championship runner-up and raced with Prema in the 2016 GP2 Series, again finishing runner-up with five wins and eight overall podiums. Giovinazzi made his competitive debut for Sauber at the 2017 Australian Grand Prix, replacing the injured Pascal Wehrlein. He also replaced Wehrlein at the following Chinese Grand Prix as Wehrlein continued his recovery. Giovinazzi raced full time for Alfa Romeo Racing from 2019 to 2021. During his tenure for Ferrari AF Corse, he won the 2023 24 Hours of Le Mans alongside James Calado and Alessandro Pier Guidi."
      },
      {
        "id": 19,
        "driverRef": "Tsunoda",
        "number": "\\N",
        "code": "TSU",
        "name": { "forename": "Yuki", "surname": "Tsunoda" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613950/tsu_t7jk1m.png"
        },
        "dob": "2000-05-11",
        "nationality": "Japanese",
        "teams": "AlphaTauri, Red Bull",
        "description": "Yuki Tsunoda (born 11 May 2000) is a Japanese racing driver currently competing in Formula One for the RB Formula One Team. Supported by Honda since 2016 through the Honda Formula Dream Project, he was the 2018 Japanese F4 champion and in 2019 also received backing from Red Bull. He finished third in the 2020 Formula 2 Championship and made his Formula One debut in 2021 for AlphaTauri."
      },
      {
        "id": 20,
        "driverRef": "Hülkenberg",
        "number": "\\N",
        "code": "HÜL",
        "name": { "forename": "Nico", "surname": "Hülkenberg" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613921/hul_lkznws.png"
        },
        "dob": "1987-08-19",
        "nationality": "German",
        "teams": "Williams, Force India, Sauber, Renaul, Racing Point,Aston Martin, Hass",
        "description": "Nicolas Hülkenberg (born 19 August 1987) is a German racing driver who drives for the Haas F1 Team in Formula One. He was the 2009 GP2 Series champion, and is a previous champion of both the Formula 3 Euro Series and A1 Grand Prix, as part of A1 Team Germany. He is one of six drivers since 2005 to win the GP2 Series/Formula 2 championship in his debut season. Outside of Formula One, he won the 24 Hours of Le Mans in 2015 on his first attempt and also contested two rounds of the 2015 FIA World Endurance Championship season for Porsche."
      },
      {
        "id": 21,
        "driverRef": "Schumacher",
        "number": "\\N",
        "code": "SCH",
        "name": { "forename": "Mick", "surname": "Schumacher" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613944/sch_frmbe9.png"
        },
        "dob": "1999-03-22",
        "nationality": "German",
        "teams": "Haas",
        "description": "Mick Schumacher (born 22 March 1999) is a Swiss-born German racing driver who is the reserve driver for the Mercedes AMG Formula One Team and McLaren, set to compete in the 2024 FIA World Endurance Championship with Alpine in the Hypercar category. Schumacher, raised in Gland, Switzerland, began his career in karting in 2008, progressing to the German ADAC Formula 4 by 2015. He initially used the pseudonym 'Mick Betsch' to avoid the spotlight due to the fame of his father, Michael Schumacher. After winning the 2018 FIA F3 European Championship, he progressed to Formula 2 in 2019, and won the 2020 Formula 2 Championship, with Prema Racing. His progression into Formula One saw him join the Ferrari Driver Academy in 2019, testing for Ferrari and Alfa Romeo before making his practice debut in the 2020 season. Schumacher competed in Formula One for Haas F1 Team in the 2021 and 2022 seasons. In 2023, he took on a new role as a reserve driver for both Mercedes-AMG Petronas Formula One Team and McLaren F1 Team. Mick Schumacher joined Alpine's World Endurance Hypercar team for the 2024 season."
      },
      {
        "id": 22,
        "driverRef": "Piastri",
        "number": "\\N",
        "code": "PIA",
        "name": { "forename": "Oscar", "surname": "Piastri" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613938/pia_o2cvri.png"
        },
        "dob": "2001-04-06",
        "nationality": "Australian",
        "teams": "McLaren",
        "description": "Oscar Jack Piastri (born 6 April 2001) is an Australian racing driver currently competing in Formula One for McLaren. Piastri won the 2019 Formula Renault Eurocup with R-ace GP, and won the 2020 FIA Formula 3 Championship and 2021 Formula 2 Championship with Prema Racing. He is only the sixth driver to win the GP2/Formula 2 Championship in their rookie season, and the fifth driver to win the GP3/Formula 3 Championship and the GP2/Formula 2 Championship in consecutive seasons. He is the first driver in history to win the Formula Renault Eurocup, Formula 3, and Formula 2 championships (or equivalent) in successive rookie years.."
      },
      {
        "id": 23,
        "driverRef": "De Vries",
        "number": "\\N",
        "code": "DVR",
        "name": { "forename": "Nyck", "surname": "De Vries" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613957/vri_bvextl.png"
        },
        "dob": "1995-02-06",
        "nationality": "Dutch",
        "teams": "Williams, AlphaTauri",
        "description": "Hendrik Johannes Nicasius 'Nyck' de Vries (born 6 February 1995) is a Dutch racing driver currently competing for Mahindra Racing in Formula E and Toyota Gazoo Racing in the FIA World Endurance Championship. He won the 2020/21 Formula E World Championship and the 2019 FIA Formula 2 Championship as well as the 2010 and 2011 Karting World Championships. He was signed to the McLaren Young Driver Programme from January 2010 until May 2019. De Vries made his Formula One debut in September 2022 as a substitute for Williams at the 2022 Italian Grand Prix. He joined Scuderia AlphaTauri for the 2023 season but was released after the 2023 British Grand Prix the 10th race of that 22-race season."
      },
      {
        "id": 24,
        "driverRef": "Latifi",
        "number": "\\N",
        "code": "LAT",
        "name": { "forename": "Nicholas", "surname": "Latifi" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613922/lat_qejkmb.png"
        },
        "dob": "1995-06-29",
        "nationality": "Canadian",
        "teams": "Williams",
        "description": "Nicholas Daniel Latifi (born 29 June 1995) is a Canadian former racing driver who last raced in Formula One. Latifi made his Formula One debut in the 2020 Austrian Grand Prix and competed with Williams for three full seasons, managing to score nine championship points. Prior to that, he served as a test and reserve driver for Renault, Force India, and Williams itself."
      },
      {
        "id": 25,
        "driverRef": "Buemi",
        "number": "\\N",
        "code": "BUE",
        "name": { "forename": "Sébastien", "surname": "Buemi" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613911/bue_ivlpic.png"
        },
        "dob": "1988-10-31",
        "nationality": "Swiss",
        "teams": "Toro Rosso, Red Bull",
        "description": "Sébastien Olivier Humbert Buemi (born 31 October 1988) is a Swiss professional racing driver, who competes in the FIA Formula E Championship for Envision Racing and in the FIA World Endurance Championship for Toyota Gazoo Racing. He competed for Scuderia Toro Rosso in Formula One from 2009 to 2011. After leaving Formula One, Buemi became a reserve driver for Scuderia Toro Rosso's sister team, Red Bull Racing from 2012 to 2013. He returned to Red Bull Racing in 2019 as a reserve driver. Buemi has competed in the FIA World Endurance Championship with Toyota Gazoo Racing (formerly Toyota Racing) since 2012. He became the 2014 World Endurance Champion in the LMP1 class. He won both the 2018 24 Hours of Le Mans and, subsequently, the 2018-19 WEC Championship. He also won the 2019, 2020 and 2022 24 Hours of Le Mans. Buemi has raced FIA Formula E Championship with e.dams Renault (now Nissan Formula E Team) since 2014. He won the Formula E Championship in 2015/16. Buemi also became part of the Nismo Global Driver Exchange."
      },
      {
        "id": 26,
        "driverRef": "Vandoorne",
        "number": "\\N",
        "code": "VAN",
        "name": { "forename": "Stoffel", "surname": "Vandoorne" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613951/van_epucgc.png"
        },
        "dob": "1992-03-26",
        "nationality": "Belgian",
        "teams": "McLaren, Mercedes, Aston Martin",
        "description": "Stoffel Vandoorne (born 26 March 1992) is a Belgian professional racing driver who is currently racing for DS Penske in Formula E and Peugeot TotalEnergies in WEC. He had previously competed in Formula One for McLaren from 2016 to 2018. He was champion of the 2015 GP2 Series and the 2021/22 Formula E World Championship. He currently resides in both Monte Carlo (Monaco) and Roeselare (Belgium)."
      },
      {
        "id": 27,
        "driverRef": "Kubica",
        "number": "\\N",
        "code": "KUB",
        "name": { "forename": "Robert", "surname": "Kubica" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613921/kub_wvd7gu.png"
        },
        "dob": "1984-12-07",
        "nationality": "Polish",
        "teams": "McLaren, Renault, Haas",
        "description": "Robert Józef Kubica (born 7 December 1984) is a Polish racing and rally driver, competing for AF Corse in the 2024 FIA World Endurance Championship. He previously competed for Team WRT where he won the 2023 FIA World Endurance Championship in the LMP2 class. He was the first and so far holds a record as of 2023, for being the only Polish racing driver to compete and win a race in Formula One which was the 2008 Canadian Grand Prix, making his latest appearance in the 2021 Italian Grand Prix."
      },
      {
        "id": 28,
        "driverRef": "Lawson",
        "number": "\\N",
        "code": "LAU",
        "name": { "forename": "Liam", "surname": "Lawson" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613926/law_d0dv5d.png"
        },
        "dob": "2002-02-11",
        "nationality": "New Zelander",
        "teams": "AlphaTauri",
        "description": "Liam Lawson (born 11 February 2002) is a New Zealand motor racing driver currently serving as a reserve driver for Red Bull Racing and RB Formula One Team. Lawson, who is mentored by three-time New Zealand Grand Prix winner Ken Smith, previously competed for the Carlin team in the FIA Formula 2 Championship, where he finished third in 2022. He is a previous Toyota Racing Series champion and former member of the Red Bull Junior Team. In 2021, he also raced for the Red Bull AF Corse team in the Deutsche Tourenwagen Masters, partnering Alex Albon, narrowly missing out on the championship in the last round. He is also the runner-up during the 2023 Super Formula Championship with Team Mugen."
      },
      {
        "id": 29,
        "driverRef": "Aitken",
        "number": "\\N",
        "code": "AIT",
        "name": { "forename": "Jack", "surname": "Aitken" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613910/ait_taltng.png"
        },
        "dob": "1995-09-23",
        "nationality": "British",
        "teams": "Renault, Williams",
        "description": "Jack Anthony Han-Aitken (born 23 September 1995 in London) is a British-South Korean racing driver who currently competes for Action Express Racing in the IMSA SportsCar Championship and for Emil Frey Racing in the Deutsche Tourenwagen Masters. He was a former reserve driver for Williams Racing in Formula One, having previously been part of the Renault Sport Academy and Williams Driver Academy. Born in London to a Scottish father and South Korean mother, Aitken began his career in karting at Buckmore Park, aged 7. He made the transition to cars when he competed in the Intersteps Championship with Fortec Motorsport, with whom he then went on to race with in the Formula Renault BARC Winter Series, Formula Renault NEC and Formula Renault Eurocup. After winning the Formula Renault Eurocup in 2015, Aitken was signed up for the Renault young driver academy, with which he remained until 2019. After competing in the GP3 Series in 2016 and 2017 he progressed to Formula 2 for 2018. He was Williams F1's reserve driver from 2020 until announcing his exit from the team in January 2023, and raced for the team at the 2020 Sakhir Grand Prix, replacing George Russell, who, in turn, replaced Lewis Hamilton at Mercedes for the event."
      },
      {
        "id": 30,
        "driverRef": "Fittipaldi",
        "number": "\\N",
        "code": "FIT",
        "name": { "forename": "Pietro", "surname": "Fittipaldi" },
        "image": {
          "url": "https://res.cloudinary.com/dth5pbvch/image/upload/v1718613911/fit_uvz8rx.png"
        },
        "dob": "1996-06-25",
        "nationality": "Brazilian",
        "teams": "Haas",
        "description": "Pietro Fittipaldi da Cruz (born 25 June 1996) is a Brazilian racing driver currently competing in the IndyCar Series driving the No. 30 Honda for Rahal Letterman Lanigan Racing, alongside serving as a test and reserve driver for Formula One team Haas. Fittipaldi is the grandson of two-time Formula One world champion Emerson Fittipaldi and brother of racing driver Enzo Fittipaldi. He made his Formula One debut with Haas at the 2020 Sakhir Grand Prix, replacing the injured Romain Grosjean, becoming the fourth member of the Fittipaldi family to race in Formula One."
      }
    ]
  }
